#include<stdio.h>   //НОМЕР ПЕРВОГО НЕНУЛЕВОГО ЧИСЛА фИБОНАЧЧИ, У КОТОРОГО 2 МЛАДШИЕ  БИТА ЗЕРКАЛЬНЫ

int test(char);//
int test(char x){//проверяет  зеркальность двух младших битов 1-байтового числа
	if ((x>>1&1)!=(x&1))  return 0;//еслт первый бвйт не равен нулевому, возвращаем 0
	return 1;//возвращаем 1, если х оканчивается либо на 00, либо на 11
}

int main(void){
//unsigned 
	char prev=0,cur=1,next,c=100; int count=1;
	c+=c;//c=200, (11001000)_2
	printf("%d\n",c);//приведение к диапазону char=[-128,127] вычитанием 256
	c+=c;//c=400=(110010000)_2, обрезанное до 8 младших двоичных цифр, т.е. %256, (10010000)_2 =(144)_10
	printf("%d\n",c);//приведение к диапазону char=[-128,127] вычитанием 256
	c+=c; //c=288=(100100000)_2, обрезанное до 8 младших двоичных цифр, т.е. %256, (00100000)_2 =(32)_10
	printf("%d\n",c);//в диапазоне char=[-128,127]

//_______________________________

	while( test(cur)==0){//перебираем числа последовательности Фибоначчи, пока  test возвращает 9 (младшие биты не зеркальны)
                count++;//номер числа
		next=cur+prev;
		prev=cur;
		cur=next;
	}

	puts("");
	printf("cur=%d cur=%x,count=%d", cur,cur,count);//печать найденного числа (в 10-ном и 16-ричном форматах) и его номера
//т.к. номер числа мал, найдено само число, а не  его младшие 8 двоичные цифры (не вышли за диапазон char)
	return 0;
}

		
